Clash Bot Workflow - Apply
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Workflow Apply 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Run</summary>

#### Workflow Apply
```

terraform
aws_iam_role_policy_attachment.retrieve_team_lambda_exec_policy: Refreshing state... [id=clash_bot_retrieve_team_exec_role-development-20231117212535732800000001]
module.create_team_step_function.data.aws_caller_identity.current: Reading...
aws_iam_role.create_team_lambda_exec: Refreshing state... [id=clash_bot_create_team_exec_role-development]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=r0loqlg3t3]
aws_iam_policy.event_handler_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development]
aws_iam_role.lambda_publisher_exec: Refreshing state... [id=clash_bot_event_publisher_exec_role-development]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
aws_iam_role_policy_attachment.create_team_lambda_exec_policy: Refreshing state... [id=clash_bot_create_team_exec_role-development-20231117070359518300000001]
aws_lambda_function.event_publisher_lambda: Refreshing state... [id=clash-bot-event-publisher-development]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
aws_iam_policy.event_publisher_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Refreshing state... [id=clash_bot_event_handler_exec_role-development-20231114032927103900000001]
aws_iam_policy.retrieve_team_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowRetrieveTeamPolicy-development]
module.create_team_step_function.data.aws_region.current[0]: Reading...
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
aws_lambda_function.retrieve_team_lambda: Refreshing state... [id=clash-bot-retrieve-team-development]
aws_lambda_function.event_handler_lambda: Refreshing state... [id=clash-bot-event-handler-development]
aws_iam_role.lambda_handler_exec: Refreshing state... [id=clash_bot_event_handler_exec_role-development]
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Refreshing state... [id=clash_bot_event_publisher_exec_role-development-20231114032927127100000002]
aws_iam_role.retrieve_team_lambda_exec: Refreshing state... [id=clash_bot_retrieve_team_exec_role-development]
aws_lambda_event_source_mapping.sqs_trigger: Refreshing state... [id=5d76167c-6bd9-488d-aee8-c6d122a624c1]
aws_lambda_function.create_team_lambda: Refreshing state... [id=clash-bot-create-team-development]
aws_iam_policy.create_team_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowCreateTeamPolicy-development]
aws_cloudwatch_log_group.api_gateway_default_log_group: Refreshing state... [id=api_gateway_default_log_group-development]
data.aws_acm_certificate.issued: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=create-team-development]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway-development]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-dynamodb]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Refreshing state... [id=zlvcq9c]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=create-team-development-dynamodb]
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2/teams"]: Refreshing state... [id=i2to2qo]
data.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=gt4pmg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.create_team_policy will be destroyed
  # (because aws_iam_policy.create_team_policy is not in configuration)
  - resource "aws_iam_policy" "create_team_policy" {
      - arn         = "arn:aws:iam::816923827429:policy/ClashBotWorkflowCreateTeamPolicy-development" -> null
      - description = "Policy for the create team lambda function." -> null
      - id          = "arn:aws:iam::816923827429:policy/ClashBotWorkflowCreateTeamPolicy-development" -> null
      - name        = "ClashBotWorkflowCreateTeamPolicy-development" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-workflow-development"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPA34NDULTS3TU4POCIU" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
    }

  # aws_iam_policy.event_handler_policy will be destroyed
  # (because aws_iam_policy.event_handler_policy is not in configuration)
  - resource "aws_iam_policy" "event_handler_policy" {
      - arn         = "arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development" -> null
      - description = "Allows the event handler lambda to interact with SQS and CloudWatch Logs" -> null
      - id          = "arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development" -> null
      - name        = "ClashBotWorkflowEventHandlerPolicy-development" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPA34NDULTSYDF2VQPVV" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
    }

  # aws_iam_policy.event_publisher_policy will be destroyed
  # (because aws_iam_policy.event_publisher_policy is not in configuration)
  - resource "aws_iam_policy" "event_publisher_policy" {
      - arn         = "arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development" -> null
      - description = "Allows the event publisher lambda to publish events to the event queue and log events to CloudWatch" -> null
      - id          = "arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development" -> null
      - name        = "ClashBotEventPublisherPolicy-development" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "sqs:SendMessage"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPA34NDULTSVVIUFCAXR" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
    }

  # aws_iam_policy.retrieve_team_policy will be destroyed
  # (because aws_iam_policy.retrieve_team_policy is not in configuration)
  - resource "aws_iam_policy" "retrieve_team_policy" {
      - arn         = "arn:aws:iam::816923827429:policy/ClashBotWorkflowRetrieveTeamPolicy-development" -> null
      - description = "Policy for the retrieve team lambda function." -> null
      - id          = "arn:aws:iam::816923827429:policy/ClashBotWorkflowRetrieveTeamPolicy-development" -> null
      - name        = "ClashBotWorkflowRetrieveTeamPolicy-development" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-workflow-development"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPA34NDULTS3MSDVV5JU" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
    }

  # aws_iam_role.create_team_lambda_exec will be destroyed
  # (because aws_iam_role.create_team_lambda_exec is not in configuration)
  - resource "aws_iam_role" "create_team_lambda_exec" {
      - arn                   = "arn:aws:iam::816923827429:role/clash_bot_create_team_exec_role-development" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-11-17T07:03:59Z" -> null
      - force_detach_policies = false -> null
      - id                    = "clash_bot_create_team_exec_role-development" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::816923827429:policy/ClashBotWorkflowCreateTeamPolicy-development",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "clash_bot_create_team_exec_role-development" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
      - unique_id             = "AROA34NDULTS3UNEJCZXK" -> null
    }

  # aws_iam_role.lambda_handler_exec will be destroyed
  # (because aws_iam_role.lambda_handler_exec is not in configuration)
  - resource "aws_iam_role" "lambda_handler_exec" {
      - arn                   = "arn:aws:iam::816923827429:role/clash_bot_event_handler_exec_role-development" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-11-14T03:29:26Z" -> null
      - force_detach_policies = false -> null
      - id                    = "clash_bot_event_handler_exec_role-development" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "clash_bot_event_handler_exec_role-development" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
      - unique_id             = "AROA34NDULTS4RNT5N56L" -> null
    }

  # aws_iam_role.lambda_publisher_exec will be destroyed
  # (because aws_iam_role.lambda_publisher_exec is not in configuration)
  - resource "aws_iam_role" "lambda_publisher_exec" {
      - arn                   = "arn:aws:iam::816923827429:role/clash_bot_event_publisher_exec_role-development" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-11-14T03:29:26Z" -> null
      - force_detach_policies = false -> null
      - id                    = "clash_bot_event_publisher_exec_role-development" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "clash_bot_event_publisher_exec_role-development" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
      - unique_id             = "AROA34NDULTS3TPKTIXZO" -> null
    }

  # aws_iam_role.retrieve_team_lambda_exec will be destroyed
  # (because aws_iam_role.retrieve_team_lambda_exec is not in configuration)
  - resource "aws_iam_role" "retrieve_team_lambda_exec" {
      - arn                   = "arn:aws:iam::816923827429:role/clash_bot_retrieve_team_exec_role-development" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-11-17T21:25:35Z" -> null
      - force_detach_policies = false -> null
      - id                    = "clash_bot_retrieve_team_exec_role-development" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::816923827429:policy/ClashBotWorkflowRetrieveTeamPolicy-development",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "clash_bot_retrieve_team_exec_role-development" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
      - unique_id             = "AROA34NDULTSWLPGEJIQT" -> null
    }

  # aws_iam_role_policy_attachment.create_team_lambda_exec_policy will be destroyed
  # (because aws_iam_role_policy_attachment.create_team_lambda_exec_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "create_team_lambda_exec_policy" {
      - id         = "clash_bot_create_team_exec_role-development-20231117070359518300000001" -> null
      - policy_arn = "arn:aws:iam::816923827429:policy/ClashBotWorkflowCreateTeamPolicy-development" -> null
      - role       = "clash_bot_create_team_exec_role-development" -> null
    }

  # aws_iam_role_policy_attachment.lambda_handler_exec_policy will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_handler_exec_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_handler_exec_policy" {
      - id         = "clash_bot_event_handler_exec_role-development-20231114032927103900000001" -> null
      - policy_arn = "arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development" -> null
      - role       = "clash_bot_event_handler_exec_role-development" -> null
    }

  # aws_iam_role_policy_attachment.lambda_publisher_exec_policy will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_publisher_exec_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_publisher_exec_policy" {
      - id         = "clash_bot_event_publisher_exec_role-development-20231114032927127100000002" -> null
      - policy_arn = "arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development" -> null
      - role       = "clash_bot_event_publisher_exec_role-development" -> null
    }

  # aws_iam_role_policy_attachment.retrieve_team_lambda_exec_policy will be destroyed
  # (because aws_iam_role_policy_attachment.retrieve_team_lambda_exec_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "retrieve_team_lambda_exec_policy" {
      - id         = "clash_bot_retrieve_team_exec_role-development-20231117212535732800000001" -> null
      - policy_arn = "arn:aws:iam::816923827429:policy/ClashBotWorkflowRetrieveTeamPolicy-development" -> null
      - role       = "clash_bot_retrieve_team_exec_role-development" -> null
    }

  # aws_lambda_event_source_mapping.sqs_trigger will be destroyed
  # (because aws_lambda_event_source_mapping.sqs_trigger is not in configuration)
  - resource "aws_lambda_event_source_mapping" "sqs_trigger" {
      - batch_size                         = 1 -> null
      - bisect_batch_on_function_error     = false -> null
      - enabled                            = true -> null
      - event_source_arn                   = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo" -> null
      - function_arn                       = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development" -> null
      - function_name                      = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development" -> null
      - function_response_types            = [] -> null
      - id                                 = "5d76167c-6bd9-488d-aee8-c6d122a624c1" -> null
      - last_modified                      = "2023-11-14T03:38:32Z" -> null
      - maximum_batching_window_in_seconds = 0 -> null
      - maximum_record_age_in_seconds      = 0 -> null
      - maximum_retry_attempts             = 0 -> null
      - parallelization_factor             = 0 -> null
      - queues                             = [] -> null
      - state                              = "Enabled" -> null
      - state_transition_reason            = "USER_INITIATED" -> null
      - topics                             = [] -> null
      - tumbling_window_in_seconds         = 0 -> null
      - uuid                               = "5d76167c-6bd9-488d-aee8-c6d122a624c1" -> null
    }

  # aws_lambda_function.create_team_lambda will be destroyed
  # (because aws_lambda_function.create_team_lambda is not in configuration)
  - resource "aws_lambda_function" "create_team_lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-create-team-development" -> null
      - function_name                  = "clash-bot-create-team-development" -> null
      - handler                        = "prod/handler.handler" -> null
      - id                             = "clash-bot-create-team-development" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:816923827429:function:clash-bot-create-team-development/invocations" -> null
      - last_modified                  = "2023-11-17T21:25:36.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-create-team-development:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:816923827429:function:clash-bot-create-team-development:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::816923827429:role/clash_bot_create_team_exec_role-development" -> null
      - runtime                        = "nodejs16.x" -> null
      - s3_bucket                      = "clash-bot-lambda-bucket" -> null
      - s3_key                         = "artifacts/development/147/create-team.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "0i7aX10YwraaEDM4lk+ORthKP5sMzyn/7lXmSJd20yU=" -> null
      - source_code_size               = 15559082 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "TABLE_NAME" = "clash-bot-workflow-development"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.event_handler_lambda will be destroyed
  # (because aws_lambda_function.event_handler_lambda is not in configuration)
  - resource "aws_lambda_function" "event_handler_lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development" -> null
      - function_name                  = "clash-bot-event-handler-development" -> null
      - handler                        = "prod/handler.handler" -> null
      - id                             = "clash-bot-event-handler-development" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development/invocations" -> null
      - last_modified                  = "2023-11-17T21:25:53.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::816923827429:role/clash_bot_event_handler_exec_role-development" -> null
      - runtime                        = "nodejs16.x" -> null
      - s3_bucket                      = "clash-bot-lambda-bucket" -> null
      - s3_key                         = "artifacts/development/147/event-handler.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "MFuOD4IP+HpIsAjbQytn6wLPFB1iv4k4wL6VDZEk0PQ=" -> null
      - source_code_size               = 16406861 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CREATE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              - "CREATE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              - "DELETE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              - "DELETE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              - "UPDATE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              - "UPDATE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.event_publisher_lambda will be destroyed
  # (because aws_lambda_function.event_publisher_lambda is not in configuration)
  - resource "aws_lambda_function" "event_publisher_lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development" -> null
      - function_name                  = "clash-bot-event-publisher-development" -> null
      - handler                        = "prod/handler.handler" -> null
      - id                             = "clash-bot-event-publisher-development" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development/invocations" -> null
      - last_modified                  = "2023-11-17T21:25:36.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::816923827429:role/clash_bot_event_publisher_exec_role-development" -> null
      - runtime                        = "nodejs16.x" -> null
      - s3_bucket                      = "clash-bot-lambda-bucket" -> null
      - s3_key                         = "artifacts/development/147/event-publisher.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "yY1+APAvM56zipsiAd9FhpK7x7i66OgECBFwFfTHCss=" -> null
      - source_code_size               = 16121462 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "QUEUE_URL" = "https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.retrieve_team_lambda will be destroyed
  # (because aws_lambda_function.retrieve_team_lambda is not in configuration)
  - resource "aws_lambda_function" "retrieve_team_lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-retrieve-team-development" -> null
      - function_name                  = "clash-bot-retrieve-team-development" -> null
      - handler                        = "prod/handler.handler" -> null
      - id                             = "clash-bot-retrieve-team-development" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:816923827429:function:clash-bot-retrieve-team-development/invocations" -> null
      - last_modified                  = "2023-11-17T21:25:46.335+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-retrieve-team-development:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:816923827429:function:clash-bot-retrieve-team-development:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::816923827429:role/clash_bot_retrieve_team_exec_role-development" -> null
      - runtime                        = "nodejs16.x" -> null
      - s3_bucket                      = "clash-bot-lambda-bucket" -> null
      - s3_key                         = "artifacts/development/147/retrieve-teams.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "LrjenRMpTG12Qe4MkntSZoyJg+PAwBj9IK4rvPtjtI0=" -> null
      - source_code_size               = 15585273 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Application" = "ClashBot-Workflow"
          - "Environment" = "development"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "TABLE_NAME" = "clash-bot-workflow-development"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_permission.apigw must be replaced
-/+ resource "aws_lambda_permission" "apigw" {
      ~ function_name       = "clash-bot-event-publisher-development" -> "event-publisher-development" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway-development" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"] will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "this" {
        id                     = "zlvcq9c"
      ~ integration_uri        = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.create_team_lambda.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Policy for the create-team lambda function."
      + id          = (known after apply)
      + name        = "create-team-Policy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-workflow-development"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # module.create_team_lambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "create_team_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.create_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "create_team_exec_role-development"
    }

  # module.create_team_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "create-team-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/development/153/create-team.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "clash-bot-workflow-development"
            }
        }
    }

  # module.create_team_step_function.aws_sfn_state_machine.this[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "this" {
      ~ definition    = jsonencode(
            {
              - Comment = "Creates a Clash Bot team for a Discord Service if the user is able to."
              - StartAt = "RetrieveTeamsForTournament"
              - States  = {
                  - CanTeamBeCreated           = {
                      - Choices = [
                          - {
                              - BooleanEquals = true
                              - Next          = "TeamAlreadyCreated"
                              - Variable      = "$.teamCreated"
                            },
                        ]
                      - Default = "CreateTeam"
                      - Type    = "Choice"
                    }
                  - CreateTeam                 = {
                      - Catch      = [
                          - {
                              - ErrorEquals = [
                                  - "States.ALL",
                                ]
                              - Next        = "DefaultErrorHandler"
                            },
                        ]
                      - End        = true
                      - OutputPath = "$.Payload"
                      - Parameters = {
                          - FunctionName = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-create-team-development"
                          - "Payload.$"  = "$"
                        }
                      - Resource   = "arn:aws:states:::lambda:invoke"
                      - Type       = "Task"
                    }
                  - DefaultErrorHandler        = {
                      - End    = true
                      - Result = "An error occurred"
                      - Type   = "Pass"
                    }
                  - RetrieveTeamsForTournament = {
                      - Catch      = [
                          - {
                              - ErrorEquals = [
                                  - "States.ALL",
                                ]
                              - Next        = "DefaultErrorHandler"
                            },
                        ]
                      - Next       = "CanTeamBeCreated"
                      - OutputPath = "$.Payload"
                      - Parameters = {
                          - FunctionName = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-retrieve-team-development"
                          - Payload      = {
                              - tournamantName = "$.Payload.tournament.tournamentName"
                              - tournamentDay  = "$.Payload.tournament.tournamentDay"
                            }
                        }
                      - Resource   = "arn:aws:states:::lambda:invoke"
                      - Type       = "Task"
                    }
                  - TeamAlreadyCreated         = {
                      - End    = true
                      - Result = "Team already created"
                      - Type   = "Pass"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
        name          = "create-team-development"
        tags          = {
            "Name" = "create-team-development"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.event_handler_lambda.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Policy for the event-handler lambda function."
      + id          = (known after apply)
      + name        = "event-handler-Policy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
                    },
                  + {
                      + Action   = "states:StartExecution"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # module.event_handler_lambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "event_handler_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.event_handler_lambda.aws_iam_role_policy_attachment.lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "event_handler_exec_role-development"
    }

  # module.event_handler_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "event-handler-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/development/153/event-handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CREATE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              + "CREATE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              + "DELETE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              + "DELETE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              + "UPDATE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
              + "UPDATE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
            }
        }
    }

  # module.event_publisher_lambda.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Policy for the event-publisher lambda function."
      + id          = (known after apply)
      + name        = "event-publisher-Policy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "sqs:SendMessage"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # module.event_publisher_lambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "event_publisher_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.event_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "event_publisher_exec_role-development"
    }

  # module.event_publisher_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "event-publisher-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/development/153/event-publisher.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "QUEUE_URL" = "https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo"
            }
        }
    }

  # module.retrieve_team_lambda.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Policy for the retrieve-team lambda function."
      + id          = (known after apply)
      + name        = "retrieve-team-Policy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-workflow-development"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # module.retrieve_team_lambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "retrieve_team_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.retrieve_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "retrieve_team_exec_role-development"
    }

  # module.retrieve_team_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "retrieve-team-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/development/153/retrieve-teams.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "clash-bot-workflow-development"
            }
        }
    }

  # module.tournament_eligibility_lambda.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Policy for the tournament-eligibility lambda function."
      + id          = (known after apply)
      + name        = "tournament-eligibility-Policy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-workflow-development"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # module.tournament_eligibility_lambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tournament_eligibility_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.tournament_eligibility_lambda.aws_iam_role_policy_attachment.lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tournament_eligibility_exec_role-development"
    }

  # module.tournament_eligibility_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "tournament-eligibility-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/development/153/is-tournament-eligible.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "clash-bot-workflow-development"
            }
        }
    }

Plan: 21 to add, 2 to change, 18 to destroy.

Changes to Outputs:
  + create-team-lambda-arn            = (known after apply)
  ~ event-handler-lambda-arn          = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development" -> (known after apply)
  - event-handler-lambda-version      = "$LATEST" -> null
  ~ event-publisher-lambda-arn        = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development" -> (known after apply)
  - event-publisher-lambda-version    = "$LATEST" -> null
  + retrieve-team-lambda-arn          = (known after apply)
  + tournament-eligibility-lambda-arn = (known after apply)
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Destroying... [id=clash_bot_event_publisher_exec_role-development-20231114032927127100000002]
aws_lambda_permission.apigw: Destroying... [id=AllowExecutionFromAPIGateway-development]
aws_iam_role_policy_attachment.retrieve_team_lambda_exec_policy: Destroying... [id=clash_bot_retrieve_team_exec_role-development-20231117212535732800000001]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Destroying... [id=clash_bot_event_handler_exec_role-development-20231114032927103900000001]
aws_iam_role_policy_attachment.create_team_lambda_exec_policy: Destroying... [id=clash_bot_create_team_exec_role-development-20231117070359518300000001]
aws_lambda_event_source_mapping.sqs_trigger: Destroying... [id=5d76167c-6bd9-488d-aee8-c6d122a624c1]
module.event_handler_lambda.aws_iam_role.lambda_exec_role: Creating...
module.retrieve_team_lambda.aws_iam_role.lambda_exec_role: Creating...
module.tournament_eligibility_lambda.aws_iam_role.lambda_exec_role: Creating...
module.create_team_lambda.aws_iam_role.lambda_exec_role: Creating...
aws_iam_role_policy_attachment.retrieve_team_lambda_exec_policy: Destruction complete after 0s
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Destruction complete after 0s
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Destruction complete after 0s
aws_iam_policy.retrieve_team_policy: Destroying... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowRetrieveTeamPolicy-development]
aws_iam_policy.event_handler_policy: Destroying... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development]
aws_iam_role_policy_attachment.create_team_lambda_exec_policy: Destruction complete after 0s
aws_iam_policy.event_publisher_policy: Destroying... [id=arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development]
aws_lambda_permission.apigw: Destruction complete after 0s
module.event_publisher_lambda.aws_iam_policy.policy: Creating...
aws_iam_policy.create_team_policy: Destroying... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowCreateTeamPolicy-development]
module.retrieve_team_lambda.aws_iam_role.lambda_exec_role: Creation complete after 0s [id=retrieve_team_exec_role-development]
module.retrieve_team_lambda.aws_iam_policy.policy: Creating...
module.tournament_eligibility_lambda.aws_iam_role.lambda_exec_role: Creation complete after 0s [id=tournament_eligibility_exec_role-development]
module.create_team_lambda.aws_iam_policy.policy: Creating...
module.create_team_lambda.aws_iam_role.lambda_exec_role: Creation complete after 0s [id=create_team_exec_role-development]
module.tournament_eligibility_lambda.aws_iam_policy.policy: Creating...
aws_iam_policy.retrieve_team_policy: Destruction complete after 0s
module.event_handler_lambda.aws_iam_role.lambda_exec_role: Creation complete after 0s [id=event_handler_exec_role-development]
aws_lambda_function.event_publisher_lambda: Destroying... [id=clash-bot-event-publisher-development]
module.event_publisher_lambda.aws_iam_role.lambda_exec_role: Creating...
aws_iam_policy.create_team_policy: Destruction complete after 0s
module.event_publisher_lambda.aws_iam_policy.policy: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/event-publisher-Policy-development]
module.retrieve_team_lambda.aws_lambda_function.lambda: Creating...
module.tournament_eligibility_lambda.aws_lambda_function.lambda: Creating...
module.retrieve_team_lambda.aws_iam_policy.policy: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/retrieve-team-Policy-development]
module.create_team_lambda.aws_lambda_function.lambda: Creating...
aws_iam_policy.event_publisher_policy: Destruction complete after 0s
module.retrieve_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creating...
module.create_team_lambda.aws_iam_policy.policy: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/create-team-Policy-development]
module.create_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creating...
module.tournament_eligibility_lambda.aws_iam_policy.policy: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/tournament-eligibility-Policy-development]
module.tournament_eligibility_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creating...
aws_iam_policy.event_handler_policy: Destruction complete after 0s
module.event_publisher_lambda.aws_iam_role.lambda_exec_role: Creation complete after 0s [id=event_publisher_exec_role-development]
module.event_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creating...
module.event_publisher_lambda.aws_lambda_function.lambda: Creating...
aws_lambda_function.event_publisher_lambda: Destruction complete after 0s
module.create_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creation complete after 2s [id=create_team_exec_role-development-20231118000957795600000001]
module.event_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creation complete after 2s [id=event_publisher_exec_role-development-20231118000957978600000002]
module.retrieve_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creation complete after 2s [id=retrieve_team_exec_role-development-20231118000958206700000003]
module.tournament_eligibility_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creation complete after 3s [id=tournament_eligibility_exec_role-development-20231118000958741200000004]
aws_lambda_event_source_mapping.sqs_trigger: Still destroying... [id=5d76167c-6bd9-488d-aee8-c6d122a624c1, 10s elapsed]
module.retrieve_team_lambda.aws_lambda_function.lambda: Still creating... [10s elapsed]
module.tournament_eligibility_lambda.aws_lambda_function.lambda: Still creating... [10s elapsed]
module.create_team_lambda.aws_lambda_function.lambda: Still creating... [10s elapsed]
module.event_publisher_lambda.aws_lambda_function.lambda: Still creating... [10s elapsed]
aws_lambda_event_source_mapping.sqs_trigger: Destruction complete after 14s
aws_lambda_function.event_handler_lambda: Destroying... [id=clash-bot-event-handler-development]
aws_lambda_function.event_handler_lambda: Destruction complete after 0s
aws_iam_role.lambda_handler_exec: Destroying... [id=clash_bot_event_handler_exec_role-development]
aws_lambda_function.retrieve_team_lambda: Destroying... [id=clash-bot-retrieve-team-development]
aws_lambda_function.create_team_lambda: Destroying... [id=clash-bot-create-team-development]
aws_iam_role.lambda_handler_exec: Destruction complete after 0s
aws_lambda_function.create_team_lambda: Destruction complete after 0s
aws_lambda_function.retrieve_team_lambda: Destruction complete after 0s
aws_iam_role.retrieve_team_lambda_exec: Destroying... [id=clash_bot_retrieve_team_exec_role-development]
aws_iam_role.create_team_lambda_exec: Destroying... [id=clash_bot_create_team_exec_role-development]
aws_iam_role.retrieve_team_lambda_exec: Destruction complete after 0s
aws_iam_role.create_team_lambda_exec: Destruction complete after 0s
module.retrieve_team_lambda.aws_lambda_function.lambda: Creation complete after 16s [id=retrieve-team-development]
module.create_team_lambda.aws_lambda_function.lambda: Creation complete after 16s [id=create-team-development]
module.tournament_eligibility_lambda.aws_lambda_function.lambda: Creation complete after 17s [id=tournament-eligibility-development]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Modifying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
module.event_publisher_lambda.aws_lambda_function.lambda: Creation complete after 17s [id=event-publisher-development]
aws_lambda_permission.apigw: Creating...
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Modifying... [id=zlvcq9c]
aws_lambda_permission.apigw: Creation complete after 0s [id=AllowExecutionFromAPIGateway-development]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Modifications complete after 0s [id=zlvcq9c]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Modifications complete after 0s [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
aws_iam_role.lambda_publisher_exec: Destroying... [id=clash_bot_event_publisher_exec_role-development]
module.event_handler_lambda.aws_iam_policy.policy: Creating...
module.event_handler_lambda.aws_lambda_function.lambda: Creating...
aws_iam_role.lambda_publisher_exec: Destruction complete after 0s
module.event_handler_lambda.aws_iam_policy.policy: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/event-handler-Policy-development]
module.event_handler_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creating...
module.event_handler_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creation complete after 0s [id=event_handler_exec_role-development-20231118001013189900000005]
module.event_handler_lambda.aws_lambda_function.lambda: Creation complete after 6s [id=event-handler-development]

Apply complete! Resources: 21 added, 2 changed, 18 destroyed.

Outputs:

api-gateway-endpoint = "https://r0loqlg3t3.execute-api.us-east-1.amazonaws.com"
create-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:create-team-development"
event-handler-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-handler-development"
event-publisher-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-publisher-development"
event-sqs = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
retrieve-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:retrieve-team-development"
step-function-arn = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
tournament-eligibility-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:tournament-eligibility-development"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*